const cctvData = {
  "1": [
    { 
      id: "a-101", 
      date: "2026/01/28", 
      time: "01:00", 
      src: "1_28_0100.jpeg", 
      memo: "コンビニ客の様子" 
    },
    { 
      id: "a-102", 
      date: "2026/01/28", 
      time: "03:09", 
      src: "1_28_0309.jpeg", 
      memo: "コンビニを出る酒井太郎" 
    },
    { 
      id: "a-103", 
      date: "2026/01/28", 
      time: "03:12", 
      src: "1_28_0312.jpeg", 
      memo: "コンビニを出る阿部沙織" 
    },
    { 
      id: "a-104", 
      date: "2026/01/28", 
      time: "03:25", 
      src: "1_28_0325.jpeg", 
      memo: "コンビニ客の様子" 
    },
    { 
      id: "a-105", 
      date: "2026/01/28", 
      time: "17:48", 
      src: "1_28_1748.jpeg", 
      memo: "コンビニの前に立つ酒井太郎" 
    }
  ],
  "2": [
    { 
      id: "a-201", 
      date: "2026/01/28", 
      time: "01:00", 
      src: "2_28_0100.jpg", 
      memo: "会社Bの様子" 
    },
    { 
      id: "a-202", 
      date: "2026/01/28", 
      time: "02:58", 
      src: "2_28_0258.png", 
      memo: "会社を出る溝口翔太郎の様子" 
    },
    { 
      id: "a-203", 
      date: "2026/01/28", 
      time: "03:29", 
      src: "2_28_0329.jpg", 
      memo: "会社Bの様子"
    },
    { 
      id: "a-204", 
      date: "2026/01/28", 
      time: "16:48", 
      src: "2_28_1648.png", 
      memo: "会社を出る溝口翔太郎の様子"
    }
  ],
  "3": [
    { 
      id: "a-301", 
      date: "2026/01/28", 
      time: "03:07", 
      src: "3_28_0307.jpeg", 
      memo: "アパートγの様子" 
    },
    { 
      id: "a-302", 
      date: "2026/01/28", 
      time: "03:24", 
      src: "3_28_0324.jpeg", 
      memo: "アパートγに帰る酒井太郎の姿" 
    },
    { 
      id: "a-303", 
      date: "2026/01/28", 
      time: "17:24", 
      src: "3_28_1724.jpeg", 
      memo: "アパートγに帰る住民たち" 
    }
  ],
  "4": [
    { 
      id: "a-410", 
      date: "2026/01/09", 
      time: "18:25", 
      src: "4_09_1825.png", 
      memo: "何者かに盗撮される被害者の様子" 
    },
    { 
      id: "a-401", 
      date: "2026/01/28", 
      time: "01:11", 
      src: "4_28_0111.jpg", 
      memo: "T字路を歩く2人の姿" 
    },
    { 
      id: "a-402", 
      date: "2026/01/28", 
      time: "03:08", 
      src: "4_28_0308.jpg", 
      memo: "T字路を歩く男の姿" 
    },
    { 
      id: "a-403", 
      date: "2026/01/28", 
      time: "08:46", 
      src: "4_28_0846.jpg", 
      memo: "T字路を通る人" 
    },
    { 
      id: "a-404", 
      date: "2026/01/29", 
      time: "11:50", 
      src: "4_29_1150.jpg", 
      memo: "T字路の様子" 
    }


  ],
  "5": [
    { 
      id: "a-501", 
      date: "2026/01/28", 
      time: "01:00", 
      src: "5_28_0100.png", 
      memo: "社宅を出る宮本勇気と高梨美穂" 
    },
    { 
      id: "a-502", 
      date: "2026/01/28", 
      time: "03:12", 
      src: "5_28_0312.png", 
      memo: "社宅αへ入る男" 
    },
    { 
      id: "a-503", 
      date: "2026/01/28", 
      time: "03:19", 
      src: "5_28_0319.png", 
      memo: "社宅αの様子" 
    },
    { 
      id: "a-504", 
      date: "2026/01/28", 
      time: "08:10", 
      src: "5_28_0810.png", 
      memo: "社宅を出る会社員たち" 
    }
  ],
  "6": [
    { 
      id: "a-601", 
      date: "2026/01/28", 
      time: "03:12", 
      src: "6_28_0312.jpg", 
      memo: "アパートβの様子" 
    },
    { 
      id: "a-602", 
      date: "2026/01/28", 
      time: "17:15", 
      src: "6_28_1715.jpeg", 
      memo: "アパートに帰る住人たち" 
    }

  ],
  "7": [
    { 
      id: "a-701", 
      date: "2026/01/28", 
      time: "01:17", 
      src: "7_28_0117.png", 
      memo: "カラオケに入る宮本と高梨" 
    },
    { 
      id: "a-702", 
      date: "2026/01/28", 
      time: "03:12", 
      src: "7_28_0312.png", 
      memo: "カラオケの人々" 
    },
    { 
      id: "a-703", 
      date: "2026/01/28", 
      time: "03:22", 
      src: "7_28_0322.jpg", 
      memo: "カラオケの客たち" 
    },
    { 
      id: "a-704", 
      date: "2026/01/28", 
      time: "04:20", 
      src: "7_28_0420.png", 
      memo: "カラオケを出る高梨" 
    },
    { 
      id: "a-705", 
      date: "2026/01/29", 
      time: "11:29", 
      src: "7_29_1129.png", 
      memo: "カラオケの客たち" 
    }
  ],
  "8": [
    { 
      id: "a-801", 
      date: "2026/01/28", 
      time: "01:00", 
      src: "8_28_0100.png", 
      memo: "会社Aの様子" 
    },
    { 
      id: "a-802", 
      date: "2026/01/28", 
      time: "03:12", 
      src: "8_28_0312.png", 
      memo: "会社Aの様子" 
    },
    { 
      id: "a-803", 
      date: "2026/01/28", 
      time: "10:35", 
      src: "8_28_1035.png", 
      memo: "会社の社員たち" 
    },
    { 
      id: "a-804", 
      date: "2026/01/28", 
      time: "17:06", 
      src: "8_28_1706.png", 
      memo: "会社を出る阿部沙織" 
    }
  ]
};